# POP3 示例

C: <client connects to service port 110>
S: +OK POP3 server ready <1896.6971@mailgate.dobbs.org>

C: USER bob
S: +OK bob

C: PASS redqueen
S: +OK bob's maildrop has 2 messages (320 octets)

C: STAT
S: +OK 2 320

C: LIST
S: +OK 2 messages (320 octets)
S: 1 120
S: 2 200
S: .

C: RETR 1
S: +OK 120 octets 
S: <the POP3 server sends the text of message 1>
S: .

C: DELE 1
S: +OK message 1 deleted

C: RETR 2 
S: +OK 200 octets
S: <the POP3 server sends the text of message 2>
S: .

C: DELE 2
S: +OK message 2 deleted 

C: QUIT
S: +OK dewey POP3 server signing off (maildrop empty)

C: <client hangs up>